Tekla Open API Reference for Tekla Structures 2025
StringList.Contains Method
 Checks if the string is in the list.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool Contains(
	string value
)
Public Function Contains (
	value As String
) As Boolean
Parameters
value
Type: System.String
The string to be checked.
Return Value
Type: Boolean
True if the string is in the list, otherwise false.
See Also
Reference
StringList Class
Tekla.Structures.Drawing Namespace